In [1]:
import pandas as pd

In [2]:
# Importing the data
url = 'https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user'
df = pd.read_csv(url, index_col = 0,sep = '|')
df.head()

         age gender  occupation zip_code
user_id
1         24      M  technician    85711
2         53      F       other    94043
3         23      M      writer    32067
4         24      M  technician    43537
5         33      F       other    15213

In [10]:
# see first 10 and last 10 entries
print("First 10 entries\n\n",df.head(10))

print("last 10 entries\n\n",df.tail(10))

First 10 entries

          age gender     occupation zip_code
user_id
1         24      M     technician    85711
2         53      F          other    94043
3         23      M         writer    32067
4         24      M     technician    43537
5         33      F          other    15213
6         42      M      executive    98101
7         57      M  administrator    91344
8         36      M  administrator    05201
9         29      M        student    01002
10        53      M         lawyer    90703
last 10 entries

          age gender     occupation zip_code
user_id
934       61      M       engineer    22902
935       42      M         doctor    66221
936       24      M          other    32789
937       48      M       educator    98072
938       38      F     technician    55038
939       26      F        student    33319
940       32      M  administrator    02215
941       20      M        student    97229
942       48      F      librarian    78209
943       22      M        student    77841

In [12]:
# What is the number of observations in the dataset?
print("Number of observation :-",df.shape[0])

Number of observation :- 943

In [14]:
# What is the number of columns in the dataset?
print("Number of column :-",df.shape[1])

Number of column :- 4

In [35]:
# Print the name of all the columns.
print("Name of all columns :-\n",df.columns)

Name of all columns :-
 Index(['age', 'gender', 'occupation', 'zip_code'], dtype='object')

In [34]:
# How is the dataset indexed?
print("Dataset indexed :-\n",df.index)

Dataset indexed :-
 Int64Index([  1,   2,   3,   4,   5,   6,   7,   8,   9,  10,
            ...
            934, 935, 936, 937, 938, 939, 940, 941, 942, 943],
           dtype='int64', name='user_id', length=943)

In [33]:
# What is the data type of each column?
print("Data type of each columns :-\n",df.dtypes)

Data type of each columns :-
 age            int64
gender        object
occupation    object
zip_code      object
dtype: object

In [32]:
# Print only the occupation column

print("only occupation columns :-\n",df['occupation'])

only occupation columns :-
 user_id
1         technician
2              other
3             writer
4         technician
5              other
           ...
939          student
940    administrator
941          student
942        librarian
943          student
Name: occupation, Length: 943, dtype: object

In [26]:
# How many different occupations are in this dataset?
print("Different occupation :-", df['occupation'].nunique())

Different occupation :- 21

In [30]:
# What is the most frequent occupation?
print("Most frequent occupation :-",df['occupation'].mode())

Most frequent occupation :- 0    student
Name: occupation, dtype: object

In [37]:
# DataFrame Info.
9print(df.info())

<class 'pandas.core.frame.DataFrame'>
Int64Index: 943 entries, 1 to 943
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   age         943 non-null    int64
 1   gender      943 non-null    object
 2   occupation  943 non-null    object
 3   zip_code    943 non-null    object
dtypes: int64(1), object(3)
memory usage: 36.8+ KB
None

In [44]:
# Describe all the columns
print(df.describe(include='all'))

               age gender occupation zip_code
count   943.000000    943        943      943
unique         NaN      2         21      795
top            NaN      M    student    55414
freq           NaN    670        196        9
mean     34.051962    NaN        NaN      NaN
std      12.192740    NaN        NaN      NaN
min       7.000000    NaN        NaN      NaN
25%      25.000000    NaN        NaN      NaN
50%      31.000000    NaN        NaN      NaN
75%      43.000000    NaN        NaN      NaN
max      73.000000    NaN        NaN      NaN

In [45]:
# Summarize only the occupation column
print(df['occupation'].describe())

count         943
unique         21
top       student
freq          196
Name: occupation, dtype: object

In [47]:
# What is the mean age of users?
print("Mean age of user :-\n",df['age'].mean())

Mean age of user :-
 34.05196182396607

In [49]:
# What is the age with least occurrence?
print("Age with least occurrence :-\n",df['age'].min())

Age with least occurrence :-
 7